# KeynoteEntries Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeynoteEntries Members
KeynoteEntries Class Methods Properties See Also
---
The KeynoteEntries type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from KeyBasedTreeEntries.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| FindEntry | Finds the KeyBasedTreeEntry associated with the given key value.  (Inherited from KeyBasedTreeEntries.) |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. (Inherited from KeyBasedTreeEntries.) |
| GetEnumerator | Returns an enumerator that iterates through a collection. (Inherited from KeyBasedTreeEntries.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetKeyBasedTreeEntriesIterator | Returns a KeyBasedTreeEntriesIterator that iterates through the collection.  (Inherited from KeyBasedTreeEntries.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| LoadKeynoteEntriesFromFile | Loads the contents of a keynote text file into the provided KeyBasedTreeEntriesLoadContent. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from KeyBasedTreeEntries.) |

# See Also
KeynoteEntries Class
Autodesk.Revit.DB Namespace